jeffreyabecker/hc32l110_lib/reference/HDSC_HC32L110.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>LPTIMER</name>
            <description>desc LPTIMER</description>
            <baseAddress>0x40000C00</baseAddress>
            <alternatePeripheral>BT0</alternatePeripheral>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x78</size>
            </addressBlock>
            <registers>
                <register>
                    <name>CNT</name>
                    <description>desc CNT</description>
                    <addressOffset>0x60</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CNT</name>
                            <description>desc CNT</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ARR</name>
                    <description>desc ARR</description>
                    <addressOffset>0x64</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>ARR</name>
                            <description>desc ARR</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CR</name>
                    <description>desc CR</description>
                    <addressOffset>0x6C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x8</resetValue>
                    <resetMask>0x7BF</resetMask>
                    <fields>
                        <field>
                            <name>TR</name>
                            <description>desc TR</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MD</name>
                            <description>desc MD</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CT</name>
                            <description>desc CT</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TOG_EN</name>
                            <description>desc TOG_EN</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TCK_SEL</name>
                            <description>desc TCK_SEL</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WT_FLAG</name>
                            <description>desc WT_FLAG</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>GATE</name>
                            <description>desc GATE</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GATE_P</name>
                            <description>desc GATE_P</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IE</name>
                            <description>desc IE</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IFR</name>
                    <description>desc IFR</description>
                    <addressOffset>0x70</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <fields>
                        <field>
                            <name>TF</name>
                            <description>desc TF</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ICLR</name>
                    <description>desc ICLR</description>
                    <addressOffset>0x74</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <fields>
                        <field>
                            <name>TFC</name>
                            <description>desc TFC</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
